Revit 2024 API
FabricationConfiguration.CanUnloadItemFiles Method
 Checks if the fabrication item files are already in use and should not be unloaded.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2019
Syntax
C#
public bool CanUnloadItemFiles(
	IList<FabricationItemFile> itemFiles
)
Visual Basic
Public Function CanUnloadItemFiles ( _
	itemFiles As IList(Of FabricationItemFile) _
) As Boolean
Visual C++
public:
bool CanUnloadItemFiles(
	IList<FabricationItemFile^>^ itemFiles
)
Parameters
itemFiles
Type: System.Collections.Generic.IList<FabricationItemFile>
 The fabrication item files to unload.
Return Value
 Returns true if the fabrication item files can be unloaded, false otherwise.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
FabricationConfiguration Class
Autodesk.Revit.DB Namespace